package com.kruvalgen.javalearn.homeWork1;
/*
1) Создать по одной переменной каждого типа данных, который ты знаешь.
2) Присвоить каждой переменной значение в диапазоне типа.
3) Вывести значение каждой переменной в консоль, каждое значение выводить с новой строки.
*/
public class First {


    public static void First() {
        byte a = 2;
        short f = 9872;
        char b = 57;
        int c = 672;
        long d = 827348;

        boolean bool = true;

        float fl = 3.65F;
        double n = 4.9684;
        System.out.println(a);
        System.out.println(f);
        System.out.println(b);
        System.out.println(c);
        System.out.println(d);
        System.out.println(bool);
        System.out.println(fl);
        System.out.println(n);
    }
}
